AuditLogs
| where OperationName == "Add member to group"
| where TargetResources contains "loganaltestgroup"
| extend InitiatedBy = tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName)
| extend AddedUPN = tostring(TargetResources[0].userPrincipalName)
| extend AADGroup = parse_json(tostring(parse_json(tostring(TargetResources[0].modifiedProperties))[1].newValue)) 
| project TimeGenerated,  OperationName, InitiatedBy, AADGroup, AddedUPN
